Importing Pandas library.

In [1]:
import pandas as pd

Make Series.

In [6]:
s=pd.Series([1 ,2, 3, 4])
print(s)

0    1
1    2
2    3
3    4
dtype: int64

using dataframe

In [7]:
data=[1, 2, 3, 4, 5]
df=pd.DataFrame(data)
print(df)    #normal output when use print
df    # jupiter make more representive when don't use print statement.

   0
0  1
1  2
2  3
3  4
4  5

   0
0  1
1  2
2  3
3  4
4  5

Columns in DataFrame.

In [8]:
data=[["alex",10],['bob',12],['clarke',12]]
df=pd.DataFrame(data,columns=['Name',"Age"])    # we tab Shift tab in jupiter they gave suggestion and definitions of all function we was use
print(df)
df

     Name  Age
0    alex   10
1     bob   12
2  clarke   12

     Name  Age
0    alex   10
1     bob   12
2  clarke   12

Index in Data Frame.

In [11]:
data={'Name':['Tom','jack','sam','riz'],'Age':[2, 5, 8, 56]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
df

       Name  Age
rank1   Tom    2
rank2  jack    5
rank3   sam    8
rank4   riz   56

Nan in pandas.

In [14]:
data=[{'a':1,'b':2,'c':3},{'a':5,'c':20}]
df=pd.DataFrame(data)
df

   a    b   c
0  1  2.0   3
1  5  NaN  20